In [101]:
import pandas as pd

In [102]:
animals = ['tiger', 'bear', 'moose']
pd.Series(animals)

0    tiger
1     bear
2    moose
dtype: object

In [103]:
nums = [1, 2, 3]
pd.Series(nums)

0    1
1    2
2    3
dtype: int64

In [104]:
animals = ['tiger', 'bear', None]
pd.Series(animals)

0    tiger
1     bear
2     None
dtype: object

In [105]:
nums = [1, 2, None]
x = pd.Series(nums)
x

0    1.0
1    2.0
2    NaN
dtype: float64

In [106]:
x.name
type(x.name)

NoneType

In [107]:
new_nums = [1, 2, 3, 4]
y = pd.Series(new_nums, name='my_numbers')
y

0    1
1    2
2    3
3    4
Name: my_numbers, dtype: int64

In [108]:
y.name

'my_numbers'

In [109]:
# Assign custom indexes to Series
animals = pd.Series(['tiger', 'bear', 'moose'], index=['india', 'usa', 'canada'])
animals

india     tiger
usa        bear
canada    moose
dtype: object

In [110]:
# Creation of a Series using Dictionary
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea',
         }
pd.Series(sports)

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [111]:
#If a "key" is not present "NaN" is stored
#If a "value" is not present "None" is stored
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          None: 'Japan',
          'Taekwondo': None,
         }
pd.Series(sports)

Archery        Bhutan
Golf         Scotland
NaN             Japan
Taekwondo        None
dtype: object

In [112]:
"""
If "keys" and "values" both are numbers and any value from keys/values is absent then both stored as NaN
and dtype is set as "float64"
"""

num_dict = {1:1,
            2:2,
            None:3,
            4:None}
pd.Series(num_dict)

1      1.0
2      2.0
NaN    3.0
4      NaN
dtype: float64

# Querying a Series

In [113]:
sports = {'Archery': 'Bhutan', 'Golf': 'Scotland', 'Sumo': 'Japan', 'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [114]:
# Wrong way: () 
# Right way: []
# Because "iloc" and "loc" are 'attributes' and not the 'methods'

# Therefore, s.iloc(2) or s.loc('Golf') will give error
s.iloc[2]

'Japan'

In [115]:
s.loc['Golf']

'Scotland'

In [116]:
s[2]

'Japan'

In [117]:
s['Golf']

'Scotland'

In [118]:
test = pd.Series(['one', 'two', 'three'], index=[(1, 2, 3), 'b', 3])
test

(1, 2, 3)      one
b              two
3            three
dtype: object

In [119]:
test['b']
test[3]
test[(1, 2, 3)]

test.loc['b']
test.loc[3]
test[(1, 2, 3)]

'one'

In [120]:
"""
If we set the numerical indexes and then try to get the series using the positional indexes then
we will get an error because Pandas will get confused whether to use positional-indexes or label-indexes 
"""

num_index_sports = {1:'China', 2:'India', 3:'US', 4:'Indonesia', 5:'Brazil'}
num_index_series = pd.Series(num_index_sports)
num_index_series

1        China
2        India
3           US
4    Indonesia
5       Brazil
dtype: object

In [121]:
"""
    Here if we try to get the first element using the positional-index 0,
    then we will get an error because it is now confused between
    numeric-label-indexes & default-numeric-positonal-indexes
"""
# num_index_series[0]
num_index_series.iloc[0]

'China'

In [122]:
import numpy as np
rand_nums = pd.Series(np.random.randint(0, 1000, 10000))
rand_nums.head()

0    557
1    357
2    574
3    139
4    518
dtype: int64

In [123]:
%%timeit -n 100
rand_nums = pd.Series(np.random.randint(0, 1000, 10000))
total = 0
for item in rand_nums:
    total += item

999 µs ± 8.18 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [124]:
%%timeit -n 100
rand_nums = pd.Series(np.random.randint(0, 1000, 10000))
total = sum(rand_nums)

679 µs ± 41.4 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [125]:
rand_nums = pd.Series(np.random.randint(0, 1000, 10000))
rand_nums.head()

0    436
1    165
2    340
3    458
4     35
dtype: int64

In [126]:
%%timeit -n 10
rand_nums = pd.Series(np.random.randint(0, 1000, 10000))
for label, value in rand_nums.iteritems():
    rand_nums.at[label] = value+2

119 ms ± 1.08 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [127]:
%%timeit -n 10
rand_nums = pd.Series(np.random.randint(0, 1000, 10000))
rand_nums += 2

365 µs ± 74.4 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

### Add new data

In [128]:
s = pd.Series([1 ,2, 3])
s

0    1
1    2
2    3
dtype: int64

In [129]:
s.loc['name'] = 'Mohit'
s

0           1
1           2
2           3
name    Mohit
dtype: object

In [130]:
original_sports = pd.Series({'Archery': 'Bhutan', 'Golf': 'Scotland', 'Sumo': 'Japan', 'Taekwondo': 'South Korea'})
cricket_loving = pd.Series(['Australia', 'Barbados', 'Pakistan', 'England'], index=['Cricket', 'Cricket', 'Cricket', 'Cricket',])

In [131]:
original_sports

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [132]:
cricket_loving

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [133]:
all_countries = original_sports.append(cricket_loving)
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [134]:
# Change the 'Cricket' to 5, 6, 7, 8 then also it will run fine

# One important thing to note is that the both the ORIGINAL Series are not MUTATED

original_sports

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [135]:
cricket_loving

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [136]:
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [137]:

original_sports.append(cricket_loving)

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [138]:
original_sports

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [139]:
type(all_countries.loc['Golf'])

str

In [140]:
type(all_countries['Cricket'])

pandas.core.series.Series

# Data Frame

In [225]:
purchase_1 = pd.Series({
    'Name': 'Chris',
    'Item Purchased': 'Dog Food',
    'Cost': 22.50
})
purchase_2 = pd.Series({
    'Name': 'Kevyn',
    'Item Purchased': 'Cat Litter',
    'Cost': 2.5
})
purchase_3 = pd.Series({
    'Name': 'Vinod',
    'Item Purchased': 'Bird Seed',
    'Cost': 5.00
})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 3'])

df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn     Cat Litter   2.5
Store 3  Vinod      Bird Seed   5.0

There are many ways we can extract the data BUT
1. If we want a row out then use the loc/iloc attribute as these are reserved for the Series.
2. If you want to extract a column then Pandas developers have reserved indexing operator [] for it i.e.
we can directly do indexing on the Data Frame.

In [226]:
# Right way of extracting a Column (using indexing operator)
df['Item Purchased']

Store 1      Dog Food
Store 1    Cat Litter
Store 3     Bird Seed
Name: Item Purchased, dtype: object

In [227]:
# This is called Chaining
# data_frame['row_label']['column_label']
# Although Chaining is able to extract the data but it is not recommended and should be avoided
# as much as possible because firstly, it is relatively slow and secondly, it returns a copy of DF instead
# of DF itself.
# Chaining can also lead to error if we want to change a data

df[:]['Item Purchased']

Store 1      Dog Food
Store 1    Cat Litter
Store 3     Bird Seed
Name: Item Purchased, dtype: object

In [228]:
# This is also Chaining
df.loc[:]['Item Purchased']

Store 1      Dog Food
Store 1    Cat Litter
Store 3     Bird Seed
Name: Item Purchased, dtype: object

In [229]:
# Chaining
df.iloc[:]['Item Purchased']

Store 1      Dog Food
Store 1    Cat Litter
Store 3     Bird Seed
Name: Item Purchased, dtype: object

What if we want some particular data only?
Let's suppose we want to get all the costs of the Store 1 only

In [230]:
df.loc['Store 1', 'Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

If we want multiple data related to a Store..
For eg. All the Items purchased with their cost from Store 1

In [231]:
df.loc['Store 1', ['Item Purchased', 'Cost']]

        Item Purchased  Cost
Store 1       Dog Food  22.5
Store 1     Cat Litter   2.5

In [232]:
# Another wrong method is to get column is to transpose and get the column like a row

# NOT RECOMMENDED 

df.T.loc['Cost']

Store 1    22.5
Store 1     2.5
Store 3       5
Name: Cost, dtype: object

In [233]:
# Get all Items Purchased with their Costs of all Stores
df.loc[:, ['Item Purchased', 'Cost']]

        Item Purchased  Cost
Store 1       Dog Food  22.5
Store 1     Cat Litter   2.5
Store 3      Bird Seed   5.0

In [234]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn     Cat Litter   2.5
Store 3  Vinod      Bird Seed   5.0

### Dropping a data

In [235]:
# 1. drop function is used to drop some data
# 2. It takes one argument as input
# 3. It does not alters the original frame

df.drop('Store 3')

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn     Cat Litter   2.5

In [236]:
# It does not alters the original frame
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn     Cat Litter   2.5
Store 3  Vinod      Bird Seed   5.0

In [237]:
df_copy = df.copy()

In [238]:
# 4. drop has 2 optional paramters
#     a) inplace = False (default) / True (To alter the original DF)
#     b) axis = 0 (default: to delete a row) / 1 (to delete a column)
df_copy.drop('Store 1', inplace=True)

In [239]:
df_copy

          Name Item Purchased  Cost
Store 3  Vinod      Bird Seed   5.0

In [240]:
df_copy = df.copy()
df_copy.drop('Cost', inplace=True, axis=1)

In [241]:
df_copy

          Name Item Purchased
Store 1  Chris       Dog Food
Store 1  Kevyn     Cat Litter
Store 3  Vinod      Bird Seed

In [242]:
# 1. Another way to delete a column is by using 'del' operator using indexing operator
# 2. It directly alters the Data Frame
# 3. It is specifically for "Columns"
del df_copy['Item Purchased']

In [243]:
df_copy

          Name
Store 1  Chris
Store 1  Kevyn
Store 3  Vinod

### Adding a new column

In [244]:
# Let's add a new Column "location" with a common value
df['Location'] = 'NYC'

In [245]:
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  22.5      NYC
Store 1  Kevyn     Cat Litter   2.5      NYC
Store 3  Vinod      Bird Seed   5.0      NYC

In [246]:
df.loc['Store 2'] = pd.Series({'Name': 'Mohit', 'Item Purchased': 'Snacks', 'Cost': 10.0, 'Location': 'India'})

In [247]:
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  22.5      NYC
Store 1  Kevyn     Cat Litter   2.5      NYC
Store 3  Vinod      Bird Seed   5.0      NYC
Store 2  Mohit         Snacks  10.0    India

In [248]:
test_1 = pd.Series(['mohit', 'soni', 30], index=['fname', 'lname', 'age'])
test_2= pd.Series(['udit', 'soni', 27], index=['fname', 'lname', 'age'])
test_3 = pd.Series(['nitin', 'soni', 29], index=['fname', 'lname', 'age'])

bro_df = pd.DataFrame([test_1, test_2, test_3], index=['Jaipur', 'Bikaner', 'Banswara'])
bro_df

          fname lname  age
Jaipur    mohit  soni   30
Bikaner    udit  soni   27
Banswara  nitin  soni   29

In [249]:
# Broadcast an operation on a Column in DF

# Let's increase the age of all the brothers after one year
bro_df['age'] += 1

In [250]:
bro_df

          fname lname  age
Jaipur    mohit  soni   31
Bikaner    udit  soni   28
Banswara  nitin  soni   30

# Read data from CSV

In [251]:
wine_df = pd.read_csv('wine_data.csv')
wine_df.head()

,Unnamed: 0,Unnamed: 0.1,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
0,0,0,Italy,"Aromas include tropical fruit, broom, brimston...",Vulkà Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin O’Keefe,@kerinokeefe,Nicosia 2013 Vulkà Bianco (Etna),White Blend,Nicosia
1,1,1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
2,2,2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
3,3,3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
4,4,4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks

In [252]:
wine_df = pd.read_csv('wine_data.csv', index_col=-3)
wine_df.head()

,Unnamed: 0,Unnamed: 0.1,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,variety,winery
title,,,,,,,,,,,,,,
Nicosia 2013 Vulkà Bianco (Etna),0,0,Italy,"Aromas include tropical fruit, broom, brimston...",Vulkà Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin O’Keefe,@kerinokeefe,White Blend,Nicosia
Quinta dos Avidagos 2011 Avidagos Red (Douro),1,1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Portuguese Red,Quinta dos Avidagos
Rainstorm 2013 Pinot Gris (Willamette Valley),2,2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Pinot Gris,Rainstorm
St. Julian 2013 Reserve Late Harvest Riesling (Lake Michigan Shore),3,3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,Riesling,St. Julian
Sweet Cheeks 2012 Vintner's Reserve Wild Child Block Pinot Noir (Willamette Valley),4,4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Pinot Noir,Sweet Cheeks

In [253]:
wine_df = pd.read_csv('wine_data.csv', skiprows=3)
wine_df.head()

,2,2.1,US,"Tart and snappy, the flavors of lime flesh and rind dominate. Some green pineapple pokes through, with crisp acidity underscoring the flavors. The wine was all stainless-steel fermented.",Unnamed: 4,87,14.0,Oregon,Willamette Valley,Willamette Valley.1,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
0,3,3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
1,4,4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks
2,5,5,Spain,Blackberry and raspberry aromas show a typical...,Ars In Vitro,87,15.0,Northern Spain,Navarra,NaN,Michael Schachner,@wineschach,Tandem 2011 Ars In Vitro Tempranillo-Merlot (N...,Tempranillo-Merlot,Tandem
3,6,6,Italy,"Here's a bright, informal red that opens with ...",Belsito,87,16.0,Sicily & Sardinia,Vittoria,NaN,Kerin O’Keefe,@kerinokeefe,Terre di Giurfo 2013 Belsito Frappato (Vittoria),Frappato,Terre di Giurfo
4,7,7,France,This dry and restrained wine offers spice in p...,NaN,87,24.0,Alsace,Alsace,NaN,Roger Voss,@vossroger,Trimbach 2012 Gewurztraminer (Alsace),Gewürztraminer,Trimbach

In [254]:
wine_df = pd.read_csv('wine_data.csv', header=2)
wine_df.head()

,1,1.1,Portugal,"This is ripe and fruity, a wine that is smooth while still structured. Firm tannins are filled out with juicy red berry fruits and freshened with acidity. It's already drinkable, although it will certainly be better from 2016.",Avidagos,87,15.0,Douro,Unnamed: 8,Unnamed: 9,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
0,2,2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
1,3,3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
2,4,4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks
3,5,5,Spain,Blackberry and raspberry aromas show a typical...,Ars In Vitro,87,15.0,Northern Spain,Navarra,NaN,Michael Schachner,@wineschach,Tandem 2011 Ars In Vitro Tempranillo-Merlot (N...,Tempranillo-Merlot,Tandem
4,6,6,Italy,"Here's a bright, informal red that opens with ...",Belsito,87,16.0,Sicily & Sardinia,Vittoria,NaN,Kerin O’Keefe,@kerinokeefe,Terre di Giurfo 2013 Belsito Frappato (Vittoria),Frappato,Terre di Giurfo

In [255]:
wine_df = pd.read_csv('wine_data.csv', index_col=2)
del wine_df['Unnamed: 0']
del wine_df['Unnamed: 0.1']
wine_df.head()

,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
country,,,,,,,,,,,,
Italy,"Aromas include tropical fruit, broom, brimston...",Vulkà Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin O’Keefe,@kerinokeefe,Nicosia 2013 Vulkà Bianco (Etna),White Blend,Nicosia
Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks

In [256]:
for col in wine_df.columns:
    if col == 'description':
        wine_df.rename(columns={col:'Vivran'}, inplace=True)
    if col == 'variety':
        wine_df.rename(columns={col: col + ' aka PRAJATI'}, inplace=True)

wine_df.head()

,Vivran,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety aka PRAJATI,winery
country,,,,,,,,,,,,
Italy,"Aromas include tropical fruit, broom, brimston...",Vulkà Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin O’Keefe,@kerinokeefe,Nicosia 2013 Vulkà Bianco (Etna),White Blend,Nicosia
Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks

In [257]:
animal = pd.read_csv('animal_data.csv', sep='|', skiprows=1, names=["number", "colour", "(a|1)", "animal"])
animal

   number colour (a|1) animal
0       1  green     x    dog
1       2   blue     y    cat
2       3    red     z   owl

In [258]:
animal = pd.read_csv('animal_data.csv', sep='|', skiprows=2)
animal

   2 blue  y   cat
0  3  red  z  owl

## Querying a DataFrame

1. Querying a DF is optimised when we use ***Boolean Masking***
2. BM is the heart of fast and wfficient querying in Numpy
3. BM is either a 1-D or a 2-D array of **True/False** for a Series or DataFrame respectively
4. This array is **overlayed** on the top of the Data Structure that we are querying
5. The cell aligned with a **True** value will only be mirrored into the result

In [259]:
# Firstly we will do a little data cleaning sp to update the index and header
# We will use Country names as index using index_col attribute
# We will use the first row as new header
olympics_df = pd.read_csv('olympics.csv', header=1, index_col=0)
for col in olympics_df.columns:
    if '01 !' in col:
        olympics_df.rename(columns={col: 'Gold' + col.split('!')[1]}, inplace=True)
    if '02 !' in col:
        olympics_df.rename(columns={col: 'Silver' + col.split('!')[1]}, inplace=True)
    if '03 !' in col:
        olympics_df.rename(columns={col: 'Bronze' + col.split('!')[1]}, inplace=True)

olympics_df.head()

,№ Summer,Gold,Silver,Bronze,Total,№ Winter,Gold.1,Silver.1,Bronze.1,Total.1,№ Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

Q1. Get only those countries which got Gold in Summer Olympics?

In [260]:
# Method 1:

gold_only_in_summer = olympics_df.where(olympics_df['Gold'] > 0)
gold_only_in_summer.head()
# gold_only['Gold'].count()

,№ Summer,Gold,Silver,Bronze,Total,№ Winter,Gold.1,Silver.1,Bronze.1,Total.1,№ Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Algeria (ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
Argentina (ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
Armenia (ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
Australasia (ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0

We can see that we are getting the countries which haven't won any Gold and their data is NaN.

Don't worry the queries ignore the NaN data

In [261]:
# We can check by comparing the Gold count of both the Countries 
gold_only_in_summer['Gold'].count(), olympics_df['Gold'].count()

(100, 147)

If we want to get rid of these NaN data then we can do this using ***dropna()*** function

In [262]:
gold_only_in_summer = gold_only_in_summer.dropna()
gold_only_in_summer.head()

,№ Summer,Gold,Silver,Bronze,Total,№ Winter,Gold.1,Silver.1,Bronze.1,Total.1,№ Games,Gold.2,Silver.2,Bronze.2,Combined total
Algeria (ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
Argentina (ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
Armenia (ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
Australasia (ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0
Australia (AUS) [AUS] [Z],25.0,139.0,152.0,177.0,468.0,18.0,5.0,3.0,4.0,12.0,43.0,144.0,155.0,181.0,480.0

**Note**: For every general operation which we can think off, Pandas developers have already created a function.

**For eg.**

We need not to use the ***where*** function in the doing the previous operation. **Indexing operator i.e. []** can take a **Boolean Mask**.

In [263]:
# Method 2:
only_gold_in_summer = olympics_df[olympics_df['Gold'] > 0]
only_gold_in_summer.head()

,№ Summer,Gold,Silver,Bronze,Total,№ Winter,Gold.1,Silver.1,Bronze.1,Total.1,№ Games,Gold.2,Silver.2,Bronze.2,Combined total
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
Australia (AUS) [AUS] [Z],25,139,152,177,468,18,5,3,4,12,43,144,155,181,480

Here, we can notice that the data which does not fulfill the criterion is already filtered out and we cannot see any NaNs.

**Note:** The O/P of two BMs when compared with a Logical Operator is another BM.

It means that we can **chain** together a bunch of **and/or** statements so as to create a more complex query and the result will a single BM.

***
***

Q2. Get all the countries which received Gold either in  Summer or Winter olympics?

In [264]:
summer_or_winter_gold = olympics_df[(olympics_df['Gold'] > 0) | (olympics_df['Gold.1'] > 0)]
len(summer_or_winter_gold)

101

Here, we can see that one extra entry is there...

***
---
Q3. Are there any countries which have received Gold in Winter only and NOT in summer?

In [265]:
gold_only_in_winter = olympics_df[(olympics_df['Gold'] == 0) & (olympics_df['Gold.1'] > 0)]
gold_only_in_winter.head()

,№ Summer,Gold,Silver,Bronze,Total,№ Winter,Gold.1,Silver.1,Bronze.1,Total.1,№ Games,Gold.2,Silver.2,Bronze.2,Combined total
Liechtenstein (LIE),16,0,0,0,0,18,2,2,5,9,34,2,2,5,9


**Note:** For each Boolean Mask we should enclose a separate parenthesis

## Indexing Data Frames

1. We all know that both Series and DF have indices
2. Indices is essentially a row-level label and the row is axis 0
    a) These indices are either inferred i.e. automatically assigned (in which we get numeric indices)
    b) Indices can be set explicitly (like we did using a Dictionary)
    
There is another way to set the index.
1. Using **set_index()** function
2. This function takes a list of Columns and promotes them to index

**Note:** set_index() is a destructive process i.e. it doesn't preserves the current index.So,

So, to preserve it we need to manually create a new column and copy the values of the index attribute into it.

***
***
Q4. We don't want the index by Countries rather we want the indexes using **Summer Gold** medals?

In [266]:
# Firstly, we will preserve the current index
olympics_df['Countries'] = olympics_df.index

# Create new index
olympics_df = olympics_df.set_index('Gold')
olympics_df.head()

,№ Summer,Silver,Bronze,Total,№ Winter,Gold.1,Silver.1,Bronze.1,Total.1,№ Games,Gold.2,Silver.2,Bronze.2,Combined total,Countries
Gold,,,,,,,,,,,,,,,
0,13,0,2,2,0,0,0,0,0,13,0,0,2,2,Afghanistan (AFG)
5,12,2,8,15,3,0,0,0,0,15,5,2,8,15,Algeria (ALG)
18,23,24,28,70,18,0,0,0,0,41,18,24,28,70,Argentina (ARG)
1,5,2,9,12,6,0,0,0,0,11,1,2,9,12,Armenia (ARM)
3,2,4,5,12,0,0,0,0,0,2,3,4,5,12,Australasia (ANZ) [ANZ]

In [267]:
# We can see the first row is completely blank. Although, it will not create any issues but if as empty values are
# considere as Nans

# But still of want to get rid of it then we can do it using "reset_index()" function
olympics_df = olympics_df.reset_index()

olympics_df.head()

,Gold,№ Summer,Silver,Bronze,Total,№ Winter,Gold.1,Silver.1,Bronze.1,Total.1,№ Games,Gold.2,Silver.2,Bronze.2,Combined total,Countries
0,0,13,0,2,2,0,0,0,0,0,13,0,0,2,2,Afghanistan (AFG)
1,5,12,2,8,15,3,0,0,0,0,15,5,2,8,15,Algeria (ALG)
2,18,23,24,28,70,18,0,0,0,0,41,18,24,28,70,Argentina (ARG)
3,1,5,2,9,12,6,0,0,0,0,11,1,2,9,12,Armenia (ARM)
4,3,2,4,5,12,0,0,0,0,0,2,3,4,5,12,Australasia (ANZ) [ANZ]

1. We can see that the New Index was promoted to Column
2. Empty Row is removed
3. A new Column Default Numbered Index is added

***
***
***
***

One nice feature which Pandas provide is ***Multi-level indexing***. It analogous to the **composite keys** in SQL databases.

In [268]:
census_df = pd.read_csv('census.csv')
census_df.head()
# census_df.loc[]

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
0,40,3,6,1,0,Alabama,Alabama,4779736,4780127,4785161,...,0.002295,-0.193196,0.381066,0.582002,-0.467369,1.030015,0.826644,1.383282,1.724718,0.712594
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861

In [269]:
# If we want to get all the unique values of a Column we will use the "unique()" function
census_df['SUMLEV'].unique()

array([40, 50])

Here, we can see only two datas are available 40 & 50.
40 represents the State data
50 represents the County data

Let's get rid of all the State level data and we will focus on the County level data

In [270]:
census_df = census_df[census_df['SUMLEV'] == 50]
census_df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861
5,50,3,6,1,9,Alabama,Blount County,57322,57322,57373,...,1.807375,-1.177622,-1.748766,-2.062535,-1.369970,1.859511,-0.848580,-1.402476,-1.577232,-0.884411

Now let's reduce the data to total **Population estimate** and **total no' of births**
1. We will create list of Column names that we want to keep
2. Project those and assign resulting DF to our variable

In [271]:
columns_to_keep = ['STNAME',
                   'CTYNAME',
                   'BIRTHS2010',
                   'BIRTHS2011',
                   'BIRTHS2012',
                   'BIRTHS2013',
                   'BIRTHS2014',
                   'BIRTHS2015',
                   'POPESTIMATE2010',
                   'POPESTIMATE2011',
                   'POPESTIMATE2012',
                   'POPESTIMATE2013',
                   'POPESTIMATE2014',
                   'POPESTIMATE2015',
                  ]
census_df = census_df[columns_to_keep]
census_df.head()

,STNAME,CTYNAME,BIRTHS2010,BIRTHS2011,BIRTHS2012,BIRTHS2013,BIRTHS2014,BIRTHS2015,POPESTIMATE2010,POPESTIMATE2011,POPESTIMATE2012,POPESTIMATE2013,POPESTIMATE2014,POPESTIMATE2015
1,Alabama,Autauga County,151,636,615,574,623,600,54660,55253,55175,55038,55290,55347
2,Alabama,Baldwin County,517,2187,2092,2160,2186,2240,183193,186659,190396,195126,199713,203709
3,Alabama,Barbour County,70,335,300,283,260,269,27341,27226,27159,26973,26815,26489
4,Alabama,Bibb County,44,266,245,259,247,253,22861,22733,22642,22512,22549,22583
5,Alabama,Blount County,183,744,710,646,618,603,57373,57711,57776,57734,57658,57673

The US Census data breaks down estimate of Population data by State and County.
So, to get a particular data we can use Multi-level indexing.

To do it:
1. We will **set_index** as combination of **state** and **county**

In [272]:
census_df = census_df.set_index(['STNAME', 'CTYNAME'])
census_df.head()

                        BIRTHS2010  BIRTHS2011  BIRTHS2012  BIRTHS2013  \
STNAME  CTYNAME
Alabama Autauga County         151         636         615         574
        Baldwin County         517        2187        2092        2160
        Barbour County          70         335         300         283
        Bibb County             44         266         245         259
        Blount County          183         744         710         646

                        BIRTHS2014  BIRTHS2015  POPESTIMATE2010  \
STNAME  CTYNAME
Alabama Autauga County         623         600            54660
        Baldwin County        2186        2240           183193
        Barbour County         260         269            27341
        Bibb County            247         253            22861
        Blount County          618         603            57373

                        POPESTIMATE2011  POPESTIMATE2012  POPESTIMATE2013  \
STNAME  CTYNAME
Alabama Autauga County            55253            55175            55038
        Baldwin County           186659           190396           195126
        Barbour County            27226            27159            26973
        Bibb County               22733            22642            22512
        Blount County             57711            57776            57734

                        POPESTIMATE2014  POPESTIMATE2015
STNAME  CTYNAME
Alabama Autauga County            55290            55347
        Baldwin County           199713           203709
        Barbour County            26815            26489
        Bibb County               22549            22583
        Blount County             57658            57673

Now let's see how can we query this hierarchical data?
1. As we know the **loc** attribute can take multiple arguments and it can take query both **rows** and **columns**
2. When we use a Multi-level index, we must provide the arguments in the order by the level we wish to query.
Note: Inside the index if there is hierarchy of different columns then they are called **levels** i.e. inside of a index each column is called a **level** and the outermost level is level 0.

***
***
***
***
Q. Suppose we want the population results from the **Washtenaw County**

In [273]:
census_df.loc['Michigan', 'Washtenaw County']

BIRTHS2010            977
BIRTHS2011           3826
BIRTHS2012           3780
BIRTHS2013           3662
BIRTHS2014           3683
BIRTHS2015           3709
POPESTIMATE2010    345563
POPESTIMATE2011    349048
POPESTIMATE2012    351213
POPESTIMATE2013    354289
POPESTIMATE2014    357029
POPESTIMATE2015    358880
Name: (Michigan, Washtenaw County), dtype: int64

Q. Suppose we want to compare two Counties 'Washtenaw County' and 'Wayne County' of 'Michigan' State?

In [274]:
census_df.loc[[('Michigan', 'Wayne County'), ('Michigan', 'Washtenaw County')]]

                           BIRTHS2010  BIRTHS2011  BIRTHS2012  BIRTHS2013  \
STNAME   CTYNAME
Michigan Wayne County            5918       23819       23270       23377
         Washtenaw County         977        3826        3780        3662

                           BIRTHS2014  BIRTHS2015  POPESTIMATE2010  \
STNAME   CTYNAME
Michigan Wayne County           23607       23586          1815199
         Washtenaw County        3683        3709           345563

                           POPESTIMATE2011  POPESTIMATE2012  POPESTIMATE2013  \
STNAME   CTYNAME
Michigan Wayne County              1801273          1792514          1775713
         Washtenaw County           349048           351213           354289

                           POPESTIMATE2014  POPESTIMATE2015
STNAME   CTYNAME
Michigan Wayne County              1766008          1759335
         Washtenaw County           357029           358880

Here, we can see that we provided a list of tuples to the loc attribute and a comparison of two Counties was displayed

Q. Reindex the purchase records DF to be indexed hierarchically, first by Store and then by Person. Also, name these indexes **Location** and **Name**. Then add new data:<br>
Name: Kevyn<br>
Item Purchased: Kitty Food <br>
Cost: 3.00<br>
Location: Store 2

In [280]:
# In our previous DF an extra was added by us 'Location' let's remove it and then we will proceed
df = df[['Name', 'Item Purchased', 'Cost']]


# Method 1:
df = df.set_index([df.index, 'Name']) # This will set a hierarchical index: 'current index', 'Name'
df

              Item Purchased  Cost
        Name
Store 1 Chris       Dog Food  22.5
        Kevyn     Cat Litter   2.5
Store 3 Vinod      Bird Seed   5.0
Store 2 Mohit         Snacks  10.0

In [281]:
# Now we will change the name of the index to 'Location' and 'Name'
df.index.names = ['Location', 'Name']
df.head()

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn     Cat Litter   2.5
Store 3  Vinod      Bird Seed   5.0
Store 2  Mohit         Snacks  10.0

In [283]:
# Add new data using the append method
df = df.append(pd.Series(data={'Cost': 3.00, 'Item Purchased': 'Kitty Food'}, name=('Store 2', 'Kevyn')))
df.head()

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn     Cat Litter   2.5
Store 3  Vinod      Bird Seed   5.0
Store 2  Mohit         Snacks  10.0
         Kevyn     Kitty Food   3.0

In [284]:
# Method 2
# df['Location'] = df.index
# df = df.set_index(['Location', 'Name'])
# df = df.append(pd.Series(data={'Cost': 3.00, 'Item Purchased': 'Kitty Food'}, name=('Store 2', 'Kevyn')))
# df